app/views/contractors/show.html.erb

      <tbody>
  <% @contractor.certificationCategories.each do |certification| %>
---
SELECT "certification_categories".* FROM "certification_categories"  WHERE "certification_categories"."contractor_id" = ?  [["contractor_id", 1]]