app/controllers/certification_categories_controller.rb

  def index
    @certification_categories = CertificationCategory.all
---
SELECT "certification_categories".* FROM "certification_categories"

  def create
    @certification_category = CertificationCategory.new(certification_category_params)
    @certification_category.contractor_id = params[:contractor_id]
    @certification_category.save
---
INSERT INTO "certification_categories" ("certificationCategory", "contractor_id", "created_at", "microDiscount", "updated_at") VALUES (?, ?, ?, ?, ?)  [["certificationCategory", "New Category"], ["contractor_id", 1], ["created_at", "2014-12-08 20:59:26.884967"], ["microDiscount", "Some discount"], ["updated_at", "2014-12-08 20:59:26.884967"]]

    def set_certification_category
      @certification_category = CertificationCategory.find(params[:id])
---
SELECT  "certification_categories".* FROM "certification_categories"  WHERE "certification_categories"."certificationCategory" = 'GENERAL BUILDING; FRAMING AND ROUGH CARPENTRY'  ORDER BY "certification_categories"."id" ASC LIMIT 1