app/controllers/contractors_controller.rb

SELECT "contractors".* FROM "contractors"   ORDER BY contractors.id DESC
---
  def index
    @contractors = Contractor.order('contractors.id ASC').all

INSERT INTO "contractors" ("address", "bondingcapacity", "city", "comments", "created_at", "email", "firstname", "lastname", "licenseClass", "licenseNo", "name", "phone", "state", "trade", "updated_at", "zipcode") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @contractor = Contractor.new(contractor_params)

    respond_to do |format|
      if @contractor.save

UPDATE "contractors" SET "logo_content_type" = ?, "logo_file_name" = ?, "logo_file_size" = ?, "logo_updated_at" = ?, "updated_at" = ? WHERE "contractors"."id" = 1  [["logo_content_type", "image/png"], ["logo_file_name", "Green.png"], ["logo_file_size", 1749], ["logo_updated_at", "2014-12-05 21:42:03.141474"], ["updated_at", "2014-12-05 21:42:03.390152"]]
---
  def update
    respond_to do |format|
      if @contractor.update(contractor_params)

DELETE FROM "contractors" WHERE "contractors"."id" = ?  [["id", 2]]
---
  def destroy
    @contractor.destroy

SELECT  "contractors".* FROM "contractors"  WHERE "contractors"."id" = 1  ORDER BY "contractors"."id" ASC LIMIT 1
---
    def set_contractor
      @contractor = Contractor.find(params[:id])